
{
  "_comment": "Article 008 - Accompagnement client",
  "id": "article-8",
  "title": "Accompagner ma première cliente dans la création de son site web",
  "tags": ["Projet client","Freelance","React" ],
  "author": "Emeric Pataut",
  "date": "8 janvier 2026",
  "banner": "/images/picture_article-8.webp",
  "excerpt": "Présentation de ma vision de l'accompagnement client",
  "image": "/images/picture_article-8.webp",
  "summary": ["Introduction", "Premiers échanges client", "Premiers pas", "Mon accompagnement", "Coté code", "Finalisation et livrables", "Avis client", "Retour d'expérience", "Conclusion" ],
  "content": {
    "introduction": "Dans cet article, je partage mon expérience d’accompagnement de ma toute première cliente dans la création de son site web. \n Au-delà du simple développement technique, ce projet a été une véritable aventure humaine et professionnelle, très enrichissante. \n Mon objectif est de présenter comment j’ai abordé cette collaboration étape par étape : depuis les premiers échanges, jusqu’à la finalisation et la livraison du site.",
    "premiers échanges client": "Tout a commencé lorsqu’elle m’a contacté via le formulaire de contact de mon portfolio. Son message était assez bref : elle souhaitait un site web pour le lancement de son activité de sophrologie, sans donner beaucoup plus de détails. \n Je lui ai répondu par un mail personnalisé pour lui proposer mon accompagnement, mais aussi pour mieux cerner son besoin. \n Je lui ai demandé des précisions sur : \n - Son domaine d’activité, \n - Ses délais, \n - Le contenu attendu sur le site, \n - Les éventuelles fonctionnalités souhaitées. \n Après quelques échanges par mail afin d’avoir une première idée de son projet, nous avons convenu d’un premier appel téléphonique. \n Cet échange d’environ 40 minutes était surtout l’occasion de répondre à ses questions et de comprendre ses attentes de manière générale. \n À l’issue de cet appel, elle a confirmé qu’elle souhaitait que je l’accompagne dans son projet de site web.",
    "premiers pas": "Nous avons commencé à travailler sur les fondations du site et avons discuté sur le contenu et la structure de celui-ci. \n Lors d’un deuxième appel (environ une heure), elle m’a présenté son parcours, les raisons qui l’ont conduite vers la sophrologie, et sa formation. J’avais besoin de comprendre son parcours et sa vision pour mieux l’accompagner. \n Nous avons esquissé ensemble la structure du site et abordé le style esthétique global qu’elle souhaitait transmettre. \n Je lui ai laissé le temps de valider cette première structure avant de continuer. \n Elle m’a ensuite transmis son logo, qui a servi de base graphique pour le site. \n Vu qu’elle n’avait pas d’idées précise sur la forme du site, j’ai travaillé sur deux maquettes graphiques. \n Lors d’une nouvelle visio, je lui ai présenté ces deux propositions de style différents : \n Elle a préféré l’une des deux, mais souhaitait aussi reprendre certains éléments de la seconde. Nous avons donc construit une version finale hybride, qui lui correspondait pleinement.",
    "mon accompagnement": "Dès le début, j’ai fait le choix d’inclure ma cliente dans le processus de développement. \n Plutôt que de travailler “en secret” et livrer un site finalisé, j’ai mis en place : \n - Des points réguliers (visios et mails hebdomadaires), \n - Un lien de prévisualisation pour qu’elle puisse suivre l’évolution en temps réel, \n - Des captures d’écran pour valider au fur et à mesure des choix graphiques. \n Nous avons avancé section par section, en intégrant ses contenus au fil de leur disponibilité. Cela lui a permis de se sentir actrice du projet, et de donner ses retours en continu. \n De mon côté, cela m’assure une certaine continuité dans le développement, m’évitant des corrections trop importantes si cela ne convient pas au client.",
    "coté code": "Techniquement, j’ai développé le site en suivant la structure validée avec ma cliente. \n <u>Sections et contenus réalisés :</u> \n - Header et bannière (hero), \n - Section À propos avec son portrait, \n - Présentation de son activité, \n - Section Prestations (après validation d’une maquette spécifique), \n - FAQ (à partir des éléments qu’elle m’a transmis), \n - Contact et Footer avec liens vers ses réseaux sociaux, \n - Mentions légales, \n - Quatre pages annexes d’information complémentaires. \n\n <u>Particularités et défis :</u> \n L’une des particularités du site, qui a été un petit défi pour moi, était la mise en page d’une section spécifique demandée par ma cliente : une image centrale entourée de paragraphes. \n J’ai dû tester trois versions avant d’obtenir le résultat souhaité, et surtout trouver une adaptabilité pour les versions tablette/mobile. \n De ce fait, cette page a trois visuels différents en fonction de la taille de l’écran d’affichage. \n En effet, la version Desktop, avec l’image au centre et les paragraphes autour ne se prête pas aux tailles d’écran plus petit. \n J’ai donc créé trois visuels diffèrent en fonction de la version Desktop, la version tablette et la version mobile. \n\n <u>Technique et déploiement :</u> \n Le site est responsive, bien sûr ! \n Optimisation des images en format webp, optimisation du code pour chargement. \n Vérification de l’accessibilité et référencement naturel. \n Le site a été déployé sur Vercel, sur un compte spécifiquement créer pour le client.",
    "finalisation et livrables": "Sur la fin du projet, il y a eu plusieurs ajustement et rectification demandées par la cliente au fur et a mesure de sa relecture du site. \n Enfin, vient l’étapes des livrables. J’ai établi plusieurs documents afin que la cliente prenne pleinement possession de son projet web mais également transmettre quelque information technique pour une éventuelle intervention ultérieur par un développeur tiers. \n Notamment : \n - Note « A lire » (pour le client) \n - Liste et accès aux comptes (hébergement, nom de domaine, service mail) \n - Dossier technique \n - Et le code source, bien entendu",
    "avis client": "Tout au long du projet, ma cliente a exprimé sa satisfaction : \n Elle a aimé la souplesse et la transparence de l’accompagnement, \n Elle a apprécié d’être impliquée à chaque étape, \n Elle a validé avec enthousiasme l’esthétique et la fluidité du site. \n\n Voici son avis : \n Très belle expérience professionnelle, de bons conseils pour la création de mon site, flexible et rigoureux. Le résultat correspond exactement à ce que je voulais.",
    "retour d'expérience": "En tant que développeur freelance, ce projet a été une expérience extrêmement enrichissante : \n J’ai appris à m’organiser sans process préétabli, en construisant progressivement ma méthode d’accompagnement, \n J’ai découvert l’importance de co-créer avec le client plutôt que d’imposer, \n Ce projet m’a permis de comprendre la valeur des points réguliers pour éviter toute mauvaise surprise, \n J’ai aussi commencé à bâtir une boîte à outils (mails types, checklist des contenus, trame de rendez-vous) pour mes prochains projets.",
    "conclusion": "Accompagner ma première cliente dans la création de son site web a été une aventure complète : humaine, technique et professionnelle. \n J’y ai découvert les joies mais aussi les défis de l’accompagnement personnalisé. \n Ce premier accompagnement confirme mon engagement en tant que développeur freelance pour accompagner toutes personne ayant un projet web et souhaitant lui donner vie. \n J’ai déjà hâte d’accompagner mon prochain client !"
  }
}
